tiborsimon/embedded-tdd-headers/pic/8bit/pic18f14k22lin_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F14K22LIN_H_
#define _PIC18F14K22LIN_H_

#define SRCON0                        0
#define SRPR                          1
#define SRPS                          2
#define SRNQEN                        3
#define SRQEN                         4
#define SRCLK0                        5
#define SRCLK                         6
#define SRCLK1                        7
#define SRCLK2                        8
#define SRLEN                         9
#define SRCON1                        10
#define SRRC1E                        11
#define SRRC2E                        12
#define SRRCKE                        13
#define SRRPE                         14
#define SRSC1E                        15
#define SRSC2E                        16
#define SRSCKE                        17
#define SRSPE                         18
#define CM2CON0                       19
#define C2CH0                         20
#define C2CH                          21
#define C2CH1                         22
#define C2R                           23
#define C2SP                          24
#define C2POL                         25
#define C2OE                          26
#define CM2CON0_C2OUT                 27
#define C2ON                          28
#define CM2CON1                       29
#define C2SYNC                        30
#define C1SYNC                        31
#define C2HYS                         32
#define C1HYS                         33
#define C2RSEL                        34
#define C1RSEL                        35
#define MC2OUT                        36
#define MC1OUT                        37
#define CM1CON0                       38
#define C1CH                          39
#define C1CH0                         40
#define C1CH1                         41
#define C1R                           42
#define C1SP                          43
#define C1POL                         44
#define C1OE                          45
#define CM1CON0_C1OUT                 46
#define C1ON                          47
#define SSPMSK                        48
#define MSK0                          49
#define MSK                           50
#define MSK1                          51
#define MSK2                          52
#define MSK3                          53
#define MSK4                          54
#define MSK5                          55
#define MSK6                          56
#define MSK7                          57
#define SLRCON                        58
#define SLRA                          59
#define SLRB                          60
#define SLRC                          61
#define WPUA0                         62
#define WPUA                          63
#define WPUA1                         64
#define WPUA2                         65
#define WPUA3                         66
#define WPUA4                         67
#define WPUA5                         68
#define WPUB                          69
#define WPUB4                         70
#define WPUB5                         71
#define WPUB6                         72
#define WPUB7                         73
#define IOCA0                         74
#define IOCA                          75
#define IOCA1                         76
#define IOCA2                         77
#define IOCA3                         78
#define IOCA4                         79
#define IOCA5                         80
#define IOCB                          81
#define IOCB4                         82
#define IOCB5                         83
#define IOCB6                         84
#define IOCB7                         85
#define ANSEL                         86
#define ANSEL0                        87
#define ANS0                          88
#define ANS1                          89
#define ANSEL1                        90
#define ANSEL2                        91
#define ANS2                          92
#define ANSEL3                        93
#define ANS3                          94
#define ANSEL4                        95
#define ANS4                          96
#define ANSEL5                        97
#define ANS5                          98
#define ANSEL6                        99
#define ANS6                          100
#define ANSEL7                        101
#define ANS7                          102
#define ANS8                          103
#define ANSEL8                        104
#define ANSELH                        105
#define ANS9                          106
#define ANSEL9                        107
#define ANSEL10                       108
#define ANS10                         109
#define ANS11                         110
#define ANSEL11                       111
#define PORTA                         112
#define ULPWUIN                       113
#define C1INP                         114
#define AN0                           115
#define PGD                           116
#define PORTA_RA0                     117
#define CVREF                         118
#define INT0                          119
#define VREFM                         120
#define AN1                           121
#define PGC                           122
#define PORTA_RA1                     123
#define INT1                          124
#define VREFP                         125
#define C12IN0M                       126
#define PORTA_RA2                     127
#define AN2                           128
#define PORTA_C1OUT                   129
#define T0CKI                         130
#define INT2                          131
#define SRQ                           132
#define RA3                           133
#define VPP                           134
#define NOT_MCLR                      135
#define MCLR                          136
#define nMCLR                         137
#define CLKOUT                        138
#define AN3                           139
#define PORTA_RA4                     140
#define OSC2                          141
#define CLKIN                         142
#define PORTA_RA5                     143
#define T13CKI                        144
#define OSC1                          145
#define LVDIN                         146
#define PORTB                         147
#define SDA                           148
#define AN10                          149
#define SDI                           150
#define PORTB_RB4                     151
#define LINRX                         152
#define PORTB_RB5                     153
#define DT                            154
#define SCL                           155
#define SCK                           156
#define PORTB_RB6                     157
#define LINCS                         158
#define CK                            159
#define PORTB_RB7                     160
#define LINTX                         161
#define PORTC                         162
#define C12INP                        163
#define C2INP                         164
#define AN4                           165
#define PORTC_RC0                     166
#define AN5                           167
#define CCP2                          168
#define C12IN1M                       169
#define PA2                           170
#define PORTC_RC1                     171
#define PA1                           172
#define AN6                           173
#define P1D                           174
#define C12IN2M                       175
#define PORTC_RC2                     176
#define AN7                           177
#define PGM                           178
#define C12IN3M                       179
#define P1C                           180
#define PORTC_RC3                     181
#define C12OUT                        182
#define P1B                           183
#define PORTC_C2OUT                   184
#define PORTC_RC4                     185
#define CCP1                          186
#define P1A                           187
#define PORTC_RC5                     188
#define PORTC_RC6                     189
#define LINRESET                      190
#define NOT_LINRESET                  191
#define nLINRESET                     192
#define PORTC_RC7                     193
#define LATA                          194
#define LATA0                         195
#define LA0                           196
#define LATA1                         197
#define LA1                           198
#define LATA2                         199
#define LA2                           200
#define LATA4                         201
#define LA4                           202
#define LATA5                         203
#define LA5                           204
#define LATB                          205
#define LB4                           206
#define LATB4                         207
#define LB5                           208
#define LATB5                         209
#define LB6                           210
#define LATB6                         211
#define LB7                           212
#define LATB7                         213
#define LATC                          214
#define LATC0                         215
#define LC0                           216
#define LATC1                         217
#define LC1                           218
#define LATC2                         219
#define LC2                           220
#define LATC3                         221
#define LC3                           222
#define LATC4                         223
#define LC4                           224
#define LATC5                         225
#define LC5                           226
#define LATC6                         227
#define LC6                           228
#define LATC7                         229
#define LC7                           230
#define PWRGD                         231
#define TRISA                         232
#define TRISA_RA0                     233
#define TRISA0                        234
#define TRISA_RA1                     235
#define TRISA1                        236
#define TRISA2                        237
#define TRISA_RA2                     238
#define TRISA_RA4                     239
#define TRISA4                        240
#define TRISA_RA5                     241
#define TRISA5                        242
#define TRISB                         243
#define TRISB4                        244
#define TRISB_RB4                     245
#define TRISB5                        246
#define TRISB_RB5                     247
#define TRISB6                        248
#define TRISB_RB6                     249
#define TRISB7                        250
#define TRISB_RB7                     251
#define TRISC                         252
#define TRISC0                        253
#define TRISC_RC0                     254
#define TRISC1                        255
#define TRISC_RC1                     256
#define TRISC2                        257
#define TRISC_RC2                     258
#define TRISC3                        259
#define TRISC_RC3                     260
#define TRISC4                        261
#define TRISC_RC4                     262
#define TRISC5                        263
#define TRISC_RC5                     264
#define TRISC6                        265
#define TRISC_RC6                     266
#define TRISC7                        267
#define TRISC_RC7                     268
#define OSCTUNE                       269
#define TUN0                          270
#define TUN                           271
#define TUN1                          272
#define TUN2                          273
#define TUN3                          274
#define TUN4                          275
#define TUN5                          276
#define PLLEN                         277
#define INTSRC                        278
#define PIE1                          279
#define TMR1IE                        280
#define TMR2IE                        281
#define CCP1IE                        282
#define SSPIE                         283
#define TXIE                          284
#define TX1IE                         285
#define RCIE                          286
#define RC1IE                         287
#define ADIE                          288
#define PIR1                          289
#define TMR1IF                        290
#define TMR2IF                        291
#define CCP1IF                        292
#define SSPIF                         293
#define TXIF                          294
#define TX1IF                         295
#define RCIF                          296
#define RC1IF                         297
#define ADIF                          298
#define IPR1                          299
#define TMR1IP                        300
#define TMR2IP                        301
#define CCP1IP                        302
#define SSPIP                         303
#define TX1IP                         304
#define TXIP                          305
#define RC1IP                         306
#define RCIP                          307
#define ADIP                          308
#define PIE2                          309
#define TMR3IE                        310
#define BCLIE                         311
#define EEIE                          312
#define C2IE                          313
#define C1IE                          314
#define CMIE                          315
#define OSCFIE                        316
#define PIR2                          317
#define TMR3IF                        318
#define BCLIF                         319
#define EEIF                          320
#define C2IF                          321
#define C1IF                          322
#define CMIF                          323
#define OSCFIF                        324
#define IPR2                          325
#define TMR3IP                        326
#define BCLIP                         327
#define EEIP                          328
#define C2IP                          329
#define C1IP                          330
#define CMIP                          331
#define OSCFIP                        332
#define EECON1                        333
#define RD                            334
#define WR                            335
#define WREN                          336
#define WRERR                         337
#define FREE                          338
#define CFGS                          339
#define EEFS                          340
#define EEPGD                         341
#define EEADR                         342
#define EEADR0                        343
#define EEADR1                        344
#define EEADR2                        345
#define EEADR3                        346
#define EEADR4                        347
#define EEADR5                        348
#define EEADR6                        349
#define EEADR7                        350
#define RCSTA                         351
#define RCD8                          352
#define RX9D                          353
#define OERR                          354
#define FERR                          355
#define ADDEN                         356
#define ADEN                          357
#define CREN                          358
#define SRENA                         359
#define SREN                          360
#define RC9                           361
#define RC8_9                         362
#define RX9                           363
#define SPEN                          364
#define TXSTA                         365
#define TXD8                          366
#define TX9D1                         367
#define TX9D                          368
#define TRMT                          369
#define TRMT1                         370
#define BRGH1                         371
#define BRGH                          372
#define SENDB1                        373
#define SENDB                         374
#define SYNC                          375
#define SYNC1                         376
#define TXEN1                         377
#define TXEN                          378
#define TX91                          379
#define TX8_9                         380
#define TX9                           381
#define CSRC1                         382
#define CSRC                          383
#define T3CON                         384
#define TMR3ON                        385
#define TMR3CS                        386
#define nT3SYNC                       387
#define NOT_T3SYNC                    388
#define T3SYNC                        389
#define SOSCEN3                       390
#define T3CCP1                        391
#define T3CKPS                        392
#define T3CKPS0                       393
#define T3CKPS1                       394
#define T3CON_RD16                    395
#define T3RD16                        396
#define RD163                         397
#define ECCP1AS                       398
#define PSSBD                         399
#define PSSBD0                        400
#define PSSBD1                        401
#define PSSAC                         402
#define PSSAC0                        403
#define PSSAC1                        404
#define ECCPAS0                       405
#define ECCPAS                        406
#define ECCPAS1                       407
#define ECCPAS2                       408
#define ECCPASE                       409
#define PWM1CON                       410
#define PDC0                          411
#define PDC                           412
#define PDC1                          413
#define PDC2                          414
#define PDC3                          415
#define PDC4                          416
#define PDC5                          417
#define PDC6                          418
#define PRSEN                         419
#define BAUDCON                       420
#define ABDEN                         421
#define W4E                           422
#define WUE                           423
#define BRG16                         424
#define SCKP                          425
#define CKTXP                         426
#define RXCKP                         427
#define DTRXP                         428
#define RCIDL                         429
#define ABDOVF                        430
#define PSTRCON                       431
#define STRA                          432
#define STRB                          433
#define STRC                          434
#define STRD                          435
#define STRSYNC                       436
#define VREFCON0                      437
#define FVR1S0                        438
#define FVR1S1                        439
#define FVR1ST                        440
#define FVR1EN                        441
#define VREFCON1                      442
#define D1NSS0                        443
#define D1NSS                         444
#define D1PSS                         445
#define D1PSS0                        446
#define D1PSS1                        447
#define DAC1OE                        448
#define D1LPS                         449
#define D1EN                          450
#define VREFCON2                      451
#define DAC1R                         452
#define DAC1R0                        453
#define DAC1R1                        454
#define DAC1R2                        455
#define DAC1R3                        456
#define DAC1R4                        457
#define CCP1CON                       458
#define CCP1M0                        459
#define CCP1M                         460
#define CCP1M1                        461
#define CCP1M2                        462
#define CCP1M3                        463
#define DC1B                          464
#define DC1B0                         465
#define DC1B1                         466
#define P1M                           467
#define P1M0                          468
#define P1M1                          469
#define ADCON2                        470
#define ADCS0                         471
#define ADCS                          472
#define ADCS1                         473
#define ADCS2                         474
#define ACQT0                         475
#define ACQT                          476
#define ACQT1                         477
#define ACQT2                         478
#define ADFM                          479
#define ADCON1                        480
#define NVCFG                         481
#define NVCFG0                        482
#define NVCFG1                        483
#define PVCFG                         484
#define PVCFG0                        485
#define CHSN3                         486
#define PVCFG1                        487
#define ADCON0                        488
#define ADON                          489
#define nDONE                         490
#define GO_nDONE                      491
#define NOT_DONE                      492
#define GODONE                        493
#define GO_DONE                       494
#define DONE                          495
#define GO_NOT_DONE                   496
#define GO                            497
#define CHS0                          498
#define CHS                           499
#define CHS1                          500
#define CHS2                          501
#define CHS3                          502
#define SSPCON2                       503
#define SEN                           504
#define RSEN                          505
#define PEN                           506
#define RCEN                          507
#define ACKEN                         508
#define ACKDT                         509
#define ACKSTAT                       510
#define GCEN                          511
#define SSPCON1                       512
#define SSPM0                         513
#define SSPM                          514
#define SSPM1                         515
#define SSPM2                         516
#define SSPM3                         517
#define CKP                           518
#define SSPEN                         519
#define SSPOV                         520
#define WCOL                          521
